app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings
    sort = params[:sort] || session[:sort]
    ratings = params[:ratings] || session[:ratings]
    if ratings.nil?
      @ratings = Movie.all_ratings
    else
      @ratings = ratings.keys
    end

    if (params[:ratings])
      session[:ratings] = params[:ratings]
    elsif (session[:ratings])
      redirect_to :sort => sort, :ratings => ratings and return
    end

    if (params[:sort])
      session[:sort] = params[:sort]
    elsif (session[:sort])
      redirect_to :sort => sort, :ratings => ratings and return
    end

    if sort == 'title'
      @title_class = "hilite"
      @movies = Movie.where(rating: @ratings).order("title asc")
    elsif sort == 'release_date'
      @release_class = "hilite"
      @movies = Movie.where(rating: @ratings).order("release_date asc")
    else
      @movies = Movie.where(rating: @ratings).all
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY title asc
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date asc
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')

  def update
    @movie = Movie.find params[:id]
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]